## 🧾 Terraform Plan for `sec_config_compliance`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.config_role will be created
  + resource "aws_iam_role" "config_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "config.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "config-role-basic"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.config_role_advanced will be created
  + resource "aws_iam_role" "config_role_advanced" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "config.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-config-role-advanced"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.config_policy_advanced will be created
  + resource "aws_iam_role_policy_attachment" "config_policy_advanced" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSConfigRole"
      + role       = "config-role-basic"
    }

  # aws_iam_role_policy_attachment.config_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "config_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSConfigRole"
      + role       = "config-role-basic"
    }

  # aws_lambda_function.s3_checker_advanced will be created
  + resource "aws_lambda_function" "s3_checker_advanced" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda/s3_checker.zip"
      + function_name                  = "s3-public-check"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

  # aws_s3_bucket.config_logs will be created
  + resource "aws_s3_bucket" "config_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-config-logs-bucket-basic"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.config_logs_advanced will be created
  + resource "aws_s3_bucket" "config_logs_advanced" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-config-bucket-advanced-example"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "expire-logs"

          + expiration {
              + days = 365
            }

          + transition {
              + days          = 30
              + storage_class = "GLACIER"
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # aws_sns_topic.compliance_alerts_advanced will be created
  + resource "aws_sns_topic" "compliance_alerts_advanced" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "compliance-alerts-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.sec_config_compliance_advanced.aws_config_config_rule.custom_rules["s3_bucket_public_read_check"] will be created
  + resource "aws_config_config_rule" "custom_rules" {
      + arn                         = (known after apply)
      + id                          = (known after apply)
      + input_parameters            = jsonencode(
            {
              + bucketName = "example"
            }
        )
      + maximum_execution_frequency = "TwentyFour_Hours"
      + name                        = "s3_bucket_public_read_check"
      + rule_id                     = (known after apply)
      + tags_all                    = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "CUSTOM_LAMBDA"
          + source_identifier = (known after apply)

          + source_detail {
              + event_source = "aws.config"
              + message_type = "ConfigurationItemChangeNotification"
            }
        }
    }

  # module.sec_config_compliance_advanced.aws_config_configuration_recorder.this will be created
  + resource "aws_config_configuration_recorder" "this" {
      + id       = (known after apply)
      + name     = "advanced-compliance-recorder"
      + role_arn = (known after apply)

      + recording_group {
          + all_supported                 = true
          + include_global_resource_types = true
        }
    }

  # module.sec_config_compliance_advanced.aws_config_configuration_recorder_status.this will be created
  + resource "aws_config_configuration_recorder_status" "this" {
      + id         = (known after apply)
      + is_enabled = true
      + name       = "advanced-compliance-recorder"
    }

  # module.sec_config_compliance_advanced.aws_config_conformance_pack.this[0] will be created
  + resource "aws_config_conformance_pack" "this" {
      + arn             = (known after apply)
      + id              = (known after apply)
      + name            = "cis-pack"
      + template_s3_uri = "s3://my-template-bucket/cis.yaml"
    }

  # module.sec_config_compliance_advanced.aws_config_delivery_channel.this will be created
  + resource "aws_config_delivery_channel" "this" {
      + id             = (known after apply)
      + name           = "advanced-delivery-channel"
      + s3_bucket_name = "my-config-logs-bucket-basic"
      + sns_topic_arn  = (known after apply)
    }

  # module.sec_config_compliance_basic.aws_config_configuration_recorder.this will be created
  + resource "aws_config_configuration_recorder" "this" {
      + id       = (known after apply)
      + name     = "default"
      + role_arn = (known after apply)

      + recording_group {
          + all_supported                 = true
          + include_global_resource_types = true
        }
    }

  # module.sec_config_compliance_basic.aws_config_configuration_recorder_status.this will be created
  + resource "aws_config_configuration_recorder_status" "this" {
      + id         = (known after apply)
      + is_enabled = true
      + name       = "default"
    }

  # module.sec_config_compliance_basic.aws_config_delivery_channel.this will be created
  + resource "aws_config_delivery_channel" "this" {
      + id             = (known after apply)
      + name           = "default"
      + s3_bucket_name = "my-config-logs-bucket-basic"
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.config_logs_advanced,
  on advanced.tf line 1, in resource "aws_s3_bucket" "config_logs_advanced":
   1: resource "aws_s3_bucket" "config_logs_advanced" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 5 more similar warnings elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->